# Intro to Pandas 

To start, we're going to look at how to get data into a DataFrame and how to look at that data. Pandas DataFrames are a class, and when we interact with these dataframes, we will be interacting with objects, accessing the dataframes fields just like we would any other objects, and manipulating the dataframe data via its methods. 

### Pandas Import 

```python
import pandas as pd
```

### Loading External Data

The [Pandas documentation](http://pandas.pydata.org/pandas-docs/stable/io.html) will show you all of the ways that you could load external data into a DataFrame. Basically, there is a way to load in data in any format that you might want to load it in from (CSV, JSON, SQL, Excel, HTML). All of these take some form of a `read_` method. So, if we wanted to load data in from a CSV, we would simply use: 

```python
df = pd.read_csv('my_data.csv')
```

**Note**: You need to have the column names as the first row in the `.csv`. 

### Instantiating a DataFrame with data from your Python program

If we are instantiating a DataFrame from data that already exists in our program, there are a couple of ways we can do this. One is by using the DataFrame constructor and passing in a list of dictionaries. Pandas will create columns with the names as the keys in the dictionary, and the values as the values in the dictionary. It will fill in values for any column that has a value present, and N/A's elsewhere. Another way of doing this is to pass in a list of lists of values as the `data` argument and another list as the `columns` argument.

In [1]:
import pandas as pd
data_lst = [{'a': 1, 'b': 2, 'c':3}, {'a': 4, 'b':5, 'c':6, 'd':7}]
df = pd.DataFrame(data_lst)
df

   a  b  c   d
0  1  2  3 NaN
1  4  5  6   7

In [5]:
data_vals = [[1, 2, 3], [4, 5, 6]]
data_cols = ['a', 'b', 'c']
df = pd.DataFrame(data=data_vals, columns=data_cols)
df

   a  b  c
0  1  2  3
1  4  5  6

### Looking at the data

I got the following data to look at [here](http://archive.ics.uci.edu/ml/machine-learning-databases/forest-fires/), the UCI repository of open data sets. I'm just going to detail four methods for looking at our data: info(), describe(), head(), and tail().

In [6]:
df = pd.read_csv('data/forestfires.csv')

In [7]:
# Gives us a very high level overview of our data. 
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 517 entries, 0 to 516
Data columns (total 13 columns):
X        517 non-null int64
Y        517 non-null int64
month    517 non-null object
day      517 non-null object
FFMC     517 non-null float64
DMC      517 non-null float64
DC       517 non-null float64
ISI      517 non-null float64
temp     517 non-null float64
RH       517 non-null int64
wind     517 non-null float64
rain     517 non-null float64
area     517 non-null float64
dtypes: float64(8), int64(3), object(2)
memory usage: 56.5+ KB

In [8]:
# Gives us a more detailed look at each of the columns in our dataset. Note that it 
# doesn't include non-numeric columns in this summary. 
df.describe()

,X,Y,FFMC,DMC,DC,ISI,temp,RH,wind,rain,area
count,517.000000,517.000000,517.000000,517.000000,517.000000,517.000000,517.000000,517.000000,517.000000,517.000000,517.000000
mean,4.669246,4.299807,90.644681,110.872340,547.940039,9.021663,18.889168,44.288201,4.017602,0.021663,12.847292
std,2.313778,1.229900,5.520111,64.046482,248.066192,4.559477,5.806625,16.317469,1.791653,0.295959,63.655818
min,1.000000,2.000000,18.700000,1.100000,7.900000,0.000000,2.200000,15.000000,0.400000,0.000000,0.000000
25%,3.000000,4.000000,90.200000,68.600000,437.700000,6.500000,15.500000,33.000000,2.700000,0.000000,0.000000
50%,4.000000,4.000000,91.600000,108.300000,664.200000,8.400000,19.300000,42.000000,4.000000,0.000000,0.520000
75%,7.000000,5.000000,92.900000,142.400000,713.900000,10.800000,22.800000,53.000000,4.900000,0.000000,6.570000
max,9.000000,9.000000,96.200000,291.300000,860.600000,56.100000,33.300000,100.000000,9.400000,6.400000,1090.840000

In [9]:
# Shows us the first 5 rows of our data set. 
df.head()

   X  Y month  day  FFMC   DMC     DC  ISI  temp  RH  wind  rain  area
0  7  5   mar  fri  86.2  26.2   94.3  5.1   8.2  51   6.7   0.0     0
1  7  4   oct  tue  90.6  35.4  669.1  6.7  18.0  33   0.9   0.0     0
2  7  4   oct  sat  90.6  43.7  686.9  6.7  14.6  33   1.3   0.0     0
3  8  6   mar  fri  91.7  33.3   77.5  9.0   8.3  97   4.0   0.2     0
4  8  6   mar  sun  89.3  51.3  102.2  9.6  11.4  99   1.8   0.0     0

In [10]:
# Shows us the last 5 rows of our data set. 
df.tail()

     X  Y month  day  FFMC    DMC     DC   ISI  temp  RH  wind  rain   area
512  4  3   aug  sun  81.6   56.7  665.6   1.9  27.8  32   2.7     0   6.44
513  2  4   aug  sun  81.6   56.7  665.6   1.9  21.9  71   5.8     0  54.29
514  7  4   aug  sun  81.6   56.7  665.6   1.9  21.2  70   6.7     0  11.16
515  1  4   aug  sat  94.4  146.0  614.7  11.3  25.6  42   4.0     0   0.00
516  6  3   nov  tue  79.5    3.0  106.7   1.1  11.8  31   4.5     0   0.00

# A little bit more of Pandas...

There are LOADS of things you can do with a Pandas DataFrame. For those of you who have worked in R, know that they were inspired by R DataFrames, and so most (if not all) of the stuff you could do in R, you can probably do here. Tonight I'm going to focus on some of the more common things that you can do with DataFrames (it would take too long to cover everything). If you want to view all of the available attributes and methods of DataFrames, you can check out the [Pandas Docs](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html). If you want practical examples of how you might use DataFrames, I might suggest getting a copy of [Python for Data Analysis](http://shop.oreilly.com/product/0636920023784.do).

Alright, let's dive in...

### Indexing to Grab your Data

Let's start off with some basic indexing. This will allow you to grab the columns, rows, etc. that you want, if you're ever in need. When we index into DataFrames, we will always be using some form of bracket notation `[]`, with two sets of numbers/strings in there separated by a comma (i.e. `[number/letter, number/letter]`. The first number will always be a reference to rows, while the second will always be a reference to columns. 

If we want to grab entire rows, then we can simply index into our DataFrame almost like we would a list - `df[rows_to_grab]`. The only caveat is that you have to use two indices separated by a `:`. If we want to grab entire columns, then we can grab those by using `df[column_name]`.

If we want to grab only certain rows and columns, there are three methods that we can use to index into a Pandas DataFrame: `.loc[]`, `.iloc[]`, and `.ix[]`. `.loc[]` is a purely label-location based indexer, `.iloc[]` is a purely integer-location based indexer, and `.ix[]` is a primarily label-location based indexer that falls back to integer indexing. Note that if we wanted to specify

In [58]:
# Let's go back to the mini-DataFrame I was working with earlier. 
import pandas as pd
data_lst = [{'a': 1, 'b': 2, 'c':3}, {'a': 4, 'b':5, 'c':6, 'd':7}]
df = pd.DataFrame(data_lst) # Create the DataFrame.
df.index

Int64Index([0, 1], dtype='int64')

In [59]:
df

   a  b  c   d
0  1  2  3 NaN
1  4  5  6   7

In [92]:
df[:1] # Note that df[1] or df[0] would not have worked.

   a  b  c   d
T  1  2  3 NaN

In [93]:
df['c']

T    3
F    6
Name: c, dtype: int64

In [69]:
df.loc[:, 'a'] # Note that df.loc[:, 1] would fail here.

4.0

In [70]:
df.iloc[:, 0] # Note that df.iloc[:, 'a'] would fail here.

0    1
1    4
Name: a, dtype: int64

In [71]:
print df.ix[:, 'a'] # With .ix[], either .ix[:, 'a'] or [:, 0] works! For this reason, I typically 
print df.ix[:, 0]   # always go with .ix[].

0    1
1    4
Name: a, dtype: int64
0    1
1    4
Name: a, dtype: int64

Now let's set up the data to be indexed by letters...

In [72]:
import pandas as pd
data_lst = [{'a': 1, 'b': 2, 'c':3}, {'a': 4, 'b':5, 'c':6, 'd':7}]
df = pd.DataFrame(data_lst, index=['T', 'F']) # Create the DataFrame.
df.index

Index([u'T', u'F'], dtype='object')

In [73]:
df

   a  b  c   d
T  1  2  3 NaN
F  4  5  6   7

In [77]:
df[:'F']

   a  b  c   d
T  1  2  3 NaN
F  4  5  6   7

In [80]:
df.loc['T', 'a'] # Note that df.loc[0, 'a'] would have failed, since the 0 is not a label,
                 # but rather an int. Integer based indexing works with .iloc or .ix, but 
                 # not .loc.

1.0

In [84]:
df.iloc[0, 0] # Note that df.iloc['T', 'a'] would have failed, as would have df.iloc['T', 0], 
              # or df.iloc[0, 'a'].

1.0

In [85]:
print df.ix[0, 0]
print df.ix['T', 'a']
print df.ix[0, 'a']
print df.ix['T', 0] # All of these work!

1.0
1
1.0
1.0

### Querying to grab your data

What if you don't know exactly what rows/columns you want to grab before hand? Is there a way that you can grab the data you want by simply specifying some query parameters? Yes! There are a couple of ways that you can do this. The first way we'll look at is just through masking, whereas the second actually uses a `.query()` method availiable on the Pandas DataFrame.

In [86]:
df # Remind ourselves of what the data looks like.

   a  b  c   d
T  1  2  3 NaN
F  4  5  6   7

Say we want to grab only those observations (rows) where `c` is equal to 3...

In [94]:
df['c'] == 3 # Note that this just gives us a True/False for each observation, for whether
             # or not that equal 3 (this is called a mask). To grab the entire row we have 
             # to do the following...

T     True
F    False
Name: c, dtype: bool

In [108]:
import numpy as np
df[df['c'] == 3]  # Here we use the mask to grab the entire row.

Empty DataFrame
Columns: [a, b, c, d]
Index: []

While using a mask like above works, this can get really messy if you have multiple conditions that you want to specify... `df[(condition1) & (condition2) & (condition3)]`. Using the `.query()` method on DataFrames is typically perferred, as it makes your code much cleaner and easier to read. All you do is put your query into a string, and the place it into the `.query()` method.

In [109]:
df.query('c == 3')

   a  b  c   d
T  1  2  3 NaN

In [110]:
df.query('c == 3 and b == 2 and a == 1') # Now we can do arbitrarily long queries more easily.

   a  b  c   d
T  1  2  3 NaN

What if I want to use the value of a variable in a query? You can usually do this (for really complicated queries/varaibles it sometimes doesn't work) by simply placing an `@` in front of the variable.

In [112]:
c = 3
b = 2
a = 1
df.query('c == @c and b == @b and a == @a')

   a  b  c   d
T  1  2  3 NaN